1cdiplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
      <types>EnumRef.ВидыДоговоровКонтрагентов_Новый</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

1cdiplom/src/Enums/ВидыДоговоровКонтрагентов_Новый/ВидыДоговоровКонтрагентов_Новый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов_Новый</name>
  <enumValues>
    <name>АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

1cdiplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
        //@skip-check undefined-variable
        Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов_Новый.АбонентскоеОбслуживание Тогда
		// Показать новые реквизиты
        Элементы.ДатаНачалаДействияДоговора.Visible = Истина;
        Элементы.ДатаОкончанияДействияДоговора.Visible = Истина;
        Элементы.СуммаЕжемесячнойАбонентскойПлаты.Visible = Истина;
        Элементы.СтоимостьЧасаРаботыСпециалиста.Visible = Истина;
    Иначе
        // Скрыть новые реквизиты
        Элементы.ДатаНачалаДействияДоговора.Visible = Ложь;
        Элементы.ДатаОкончанияДействияДоговора.Visible = Ложь;
        Элементы.СуммаЕжемесячнойАбонентскойПлаты.Visible = Ложь;
        Элементы.СтоимостьЧасаРаботыСпециалиста.Visible = Ложь;
    КонецЕсли;
КонецПроцедуры
